app/Models/EtudiantModel.php

SELECT *
FROM `etudiants`
---
    public function findAll(?int $limit = null, int $offset = 0)
    {
        $builder = $this->db->table($this->table);
        if ($limit !== null) {
            $builder->limit($limit, $offset);
        }

        return $builder->get()->getResult();