app/Models/GroupeOptionnelModel.php

SELECT *
FROM `groupes_optionnels`
WHERE `id_semestre` IN ('1','2','3','4')
---
    public function getGroupsBySemestreIds(array $semestreIds): array
    {
        if (empty($semestreIds)) {
            return [];
        }

        return $this->db->table('groupes_optionnels')
            ->whereIn('id_semestre', $semestreIds)
            ->get()
            ->getResultArray();

SELECT `id_groupe`, `id_matiere`
FROM `groupes_optionnels_matieres`
WHERE `id_groupe` IN ('1','2','3','4','5','6')
---
    public function getGroupMatieresMap(array $groupIds): array
    {
        if (empty($groupIds)) {
            return [];
        }

        $rows = $this->db->table('groupes_optionnels_matieres')
            ->select('id_groupe, id_matiere')
            ->whereIn('id_groupe', $groupIds)
            ->get()
            ->getResultArray();