app/Models/MatiereModel.php

SELECT *
FROM `matieres`
WHERE `id_semestre` IN ('1','2','3','4')
---
        public function getMatieresBySemestreIds(array $semestreIds) {
            if (empty($semestreIds)) {
                return [];
            }

            return $this->db->table('matieres')
                ->whereIn('id_semestre', $semestreIds)
                ->get()
                ->getResultArray();

SELECT `m`.`id`, `m`.`ue`, `m`.`intitule`, `m`.`id_semestre`, `m`.`credits`, `s`.`nom` AS `semestre_nom`
FROM `matieres` `m`
LEFT JOIN `semestres` `s` ON `s`.`id` = `m`.`id_semestre`
ORDER BY `s`.`nom` ASC, `m`.`ue` ASC
---
        public function getMatieresWithSemestre(): array
        {
            return $this->db->table('matieres m')
                ->select('m.id, m.ue, m.intitule, m.id_semestre, m.credits, s.nom AS semestre_nom')
                ->join('semestres s', 's.id = m.id_semestre', 'left')
                ->orderBy('s.nom', 'ASC')
                ->orderBy('m.ue', 'ASC')
                ->get()
                ->getResultArray();