app/Models/NoteModel.php

    public function getAllWithRelations(): array
    {
        return $this->db->table('notes n')
            ->select('n.id, n.valeur, n.id_etudiant, n.id_matiere, e.nom AS etudiant_nom, e.prenom AS etudiant_prenom, e.num_inscription, m.ue, m.intitule, s.nom AS semestre_nom')
            ->join('etudiants e', 'e.id = n.id_etudiant', 'left')
            ->join('matieres m', 'm.id = n.id_matiere', 'left')
            ->join('semestres s', 's.id = n.id_semestre', 'left')
            ->orderBy('e.nom', 'ASC')
            ->orderBy('e.prenom', 'ASC')
            ->orderBy('s.nom', 'ASC')
            ->orderBy('m.ue', 'ASC')
            ->get()
            ->getResultArray();
---
SELECT `n`.`id`, `n`.`valeur`, `n`.`id_etudiant`, `n`.`id_matiere`, `e`.`nom` AS `etudiant_nom`, `e`.`prenom` AS `etudiant_prenom`, `e`.`num_inscription`, `m`.`ue`, `m`.`intitule`, `s`.`nom` AS `semestre_nom`
FROM `notes` `n`
LEFT JOIN `etudiants` `e` ON `e`.`id` = `n`.`id_etudiant`
LEFT JOIN `matieres` `m` ON `m`.`id` = `n`.`id_matiere`
LEFT JOIN `semestres` `s` ON `s`.`id` = `n`.`id_semestre`
ORDER BY `e`.`nom` ASC, `e`.`prenom` ASC, `s`.`nom` ASC, `m`.`ue` ASC

    public function getByIdWithRelations(int $id): ?array
    {
        $row = $this->db->table('notes n')
            ->select('n.id, n.valeur, n.id_etudiant, n.id_matiere, e.nom AS etudiant_nom, e.prenom AS etudiant_prenom, e.num_inscription, m.ue, m.intitule, s.nom AS semestre_nom')
            ->join('etudiants e', 'e.id = n.id_etudiant', 'left')
            ->join('matieres m', 'm.id = n.id_matiere', 'left')
            ->join('semestres s', 's.id = n.id_semestre', 'left')
            ->where('n.id', $id)
            ->get()
            ->getRowArray();
---
SELECT `n`.`id`, `n`.`valeur`, `n`.`id_etudiant`, `n`.`id_matiere`, `e`.`nom` AS `etudiant_nom`, `e`.`prenom` AS `etudiant_prenom`, `e`.`num_inscription`, `m`.`ue`, `m`.`intitule`, `s`.`nom` AS `semestre_nom`
FROM `notes` `n`
LEFT JOIN `etudiants` `e` ON `e`.`id` = `n`.`id_etudiant`
LEFT JOIN `matieres` `m` ON `m`.`id` = `n`.`id_matiere`
LEFT JOIN `semestres` `s` ON `s`.`id` = `n`.`id_semestre`
WHERE `n`.`id` = 19

    public function getPagedWithRelations(int $perPage = 10, string $group = 'notes'): array
    {
        return $this->select('notes.id, notes.valeur, notes.id_etudiant, notes.id_matiere, e.nom AS etudiant_nom, e.prenom AS etudiant_prenom, e.num_inscription, m.ue, m.intitule, s.nom AS semestre_nom')
            ->join('etudiants e', 'e.id = notes.id_etudiant', 'left')
            ->join('matieres m', 'm.id = notes.id_matiere', 'left')
            ->join('semestres s', 's.id = notes.id_semestre', 'left')
            ->orderBy('e.nom', 'ASC')
            ->orderBy('e.prenom', 'ASC')
            ->orderBy('s.nom', 'ASC')
            ->orderBy('m.ue', 'ASC')
            ->paginate($perPage, $group);
---
SELECT COUNT(*) AS `numrows`
FROM `notes`
LEFT JOIN `etudiants` `e` ON `e`.`id` = `notes`.`id_etudiant`
LEFT JOIN `matieres` `m` ON `m`.`id` = `notes`.`id_matiere`
LEFT JOIN `semestres` `s` ON `s`.`id` = `notes`.`id_semestre`
SELECT `notes`.`id`, `notes`.`valeur`, `notes`.`id_etudiant`, `notes`.`id_matiere`, `e`.`nom` AS `etudiant_nom`, `e`.`prenom` AS `etudiant_prenom`, `e`.`num_inscription`, `m`.`ue`, `m`.`intitule`, `s`.`nom` AS `semestre_nom`
FROM `notes`
LEFT JOIN `etudiants` `e` ON `e`.`id` = `notes`.`id_etudiant`
LEFT JOIN `matieres` `m` ON `m`.`id` = `notes`.`id_matiere`
LEFT JOIN `semestres` `s` ON `s`.`id` = `notes`.`id_semestre`
ORDER BY `e`.`nom` ASC, `e`.`prenom` ASC, `s`.`nom` ASC, `m`.`ue` ASC
 LIMIT 10