app/Models/NoteModel.php

SELECT COUNT(*) AS `numrows`
FROM `notes`
JOIN `etudiants` ON `notes`.`id_etudiant` = `etudiants`.`id`
JOIN `matieres` ON `notes`.`id_matiere` = `matieres`.`id`
JOIN `semestres` ON `notes`.`id_semestre` = `semestres`.`id`
WHERE `etudiants`.`num_inscription` LIKE '%2356%' ESCAPE '!'
SELECT `notes`.*, `etudiants`.`num_inscription` as `etu`, `matieres`.`intitule` as `mat_intitule`, `semestres`.`nom` as `semestre`
FROM `notes`
JOIN `etudiants` ON `notes`.`id_etudiant` = `etudiants`.`id`
JOIN `matieres` ON `notes`.`id_matiere` = `matieres`.`id`
JOIN `semestres` ON `notes`.`id_semestre` = `semestres`.`id`
WHERE `etudiants`.`num_inscription` LIKE '%2356%' ESCAPE '!'
 LIMIT 10
---
    public function getNotesWithInfos($etudiant=null, $matiere=null, $semestre=null) {
        $builder = $this->select('notes.*, etudiants.num_inscription as etu, matieres.intitule as mat_intitule, semestres.nom as semestre')
                        ->join('etudiants', 'notes.id_etudiant = etudiants.id')
                        ->join('matieres', 'notes.id_matiere = matieres.id')
                        ->join('semestres', 'notes.id_semestre = semestres.id');

        if ($etudiant) {
            $builder->like('etudiants.num_inscription', $etudiant);
        }

        if ($matiere) {
            $builder->where('matieres.id', $matiere);
        }

        if ($semestre) {
            $builder->where('semestres.id', $semestre);
        }

        $notes = $builder->paginate(10);