app/Models/SemestreModel.php

SELECT *
FROM `semestres`
WHERE `nom` IN ('S3','S4 - Bases de Donnees et Reseaux','S4 - Developpement','S4 - Web et Design')
---
    public function getByNames(array $names): array
    {
        if (empty($names)) {
            return [];
        }

        return $this->db->table('semestres')
            ->whereIn('nom', $names)
            ->get()
            ->getResultArray();

SELECT `s`.`id`, `s`.`nom`, `s`.`id_option`, `s`.`id_classe`, `o`.`nom` AS `option_nom`, `c`.`nom` AS `classe_nom`
FROM `semestres` `s`
LEFT JOIN `options` `o` ON `o`.`id` = `s`.`id_option`
LEFT JOIN `classes` `c` ON `c`.`id` = `s`.`id_classe`
ORDER BY `s`.`nom` ASC
---
    public function getAllWithOptionAndClasse(): array
    {
        return $this->db->table('semestres s')
            ->select('s.id, s.nom, s.id_option, s.id_classe, o.nom AS option_nom, c.nom AS classe_nom')
            ->join('options o', 'o.id = s.id_option', 'left')
            ->join('classes c', 'c.id = s.id_classe', 'left')
            ->orderBy('s.nom', 'ASC')
            ->get()
            ->getResultArray();